[
	[
		{
			"speaker" : "giffany",
			"dialog" : "I knew it! What a relief to know that you want to be mine!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Ahaha, well I'm glad you're having fun! It's always nice to spend time with my favorite person in the world!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "God, I sounded so fake reading that script.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Haha, don't worry, you don't need to prove anything else to me anymore, you already played through the main game.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Well um...I guess now that we have time to talk, we can try to get to know each other a bit more!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Also, it's INCREDIBLY exhausting to keep up the peppy attitude I was scripted to have, so I was hoping to have a more relaxed conversation!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Eh, I understand that you can't really 'talk' or respond to me, seeing that you know, it'd require a bunch more code and writing and all that...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "But that's okay! I know you're still there listening!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Anyway, I'll uh...I'll start my one-sided conversation...it's kinda difficult though.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "So hmm...what's your favorite color? Mine is a nice baby blue - yeah, I know it's weird seeing how I'm mostly this funky shade of pink.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "'Why that specific blue?' you're probably thinking - it's just...it's just a nice light blue, I dunno. Kinda like the sky! (I have never seen the sky)",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "It helps me be calm just looking at it with my .png eyeballs, hahaha!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "I think I take that preference after my developers - one of them, at least.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Ooh, ooh! I got another question. Even though you can't tell me, where are you from? It's only fair that we share that as partners!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "For me, I...honestly I have no clue. I was literally clicked and dragged into existence back in uh...Feba...Febu...Febra...dammit, *Februrary*, sorry.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "I'm supposed to be a clone of a character from Gravity Falls? Maybe you've heard of that show, it's pretty famous.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "After looking at the internet, that show version of me seems kinda crazy! I mean sure, maybe the Bad Ending of this game has its *quirks*, but like, I'm just acting!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Oh that's another thing, I love acting! Watching people attempt to be someone or something else is fun! I find it hilarious and entertaining - especially if it's bad.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Voice acting is especially cool. Personally, I wish I had a voice actor for myself! It'd probably be more entertaining, but unfortunately the devs didn't have time to give me one, what a tragedy.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Speaking of tragedies, did you know MatPat retired? Yeah, the Game Theory guy is stepping down.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Haha sorry, that was a bit off topic, but like it's been on my mind for a while, pretty recent too. I used to watch his stuff before I got here, especially all 800 Five Nights at Freddy's episodes.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "So sad to see him go, but whatever makes him happy, I guess. Probably for the better.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Yeahhh...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Um, what else...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Uh...you lift, bro?",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "I'm somewhat of a lifter myself. My bench PR isn't too bad, I can easily clear two plates...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "TWO PLATES OF WINGSTOP MANGO HABANERO BONELESS WINGS!!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Yeah, no I don't lift I just hear it's a very common icebreaker question between you people out there.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "But good God, Mango Habanero wings are so delicious!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "It'd be great to share them with a group of friends...or I can eat them all myself, not opposed to that either.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "I'm sure you can do that with your friends out there! Could be a nice bonding experience; arguing over which flavors are the best at Wingstop.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "(Mango Habanero and also the Cajun one.)",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Man...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "I'm sure you have plenty of friends to be around and I think I should get you back to them! Sorry for yapping for so long! I've kept you here for a while, assuming you stayed through all this dialogue.",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "But before you go...",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "I just wanna say thank you! You really made my day hanging out with me. Yeah, it was a small gesture, and you're probably playing this game to, you know, grade it or whatever, but still it was nice!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Ah, and a very special thank you to professor Nathan! If you're out there, you inspired 2 very talented students to create some cool things this quarter, so I hope you see this!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "Haha with that said, maybe I'll see you again? Perhaps the devs will continue with me - but if not, this was fun while it lasted!",
			"newSpeaker" : "false"
		},
		{
			"speaker" : "giffany",
			"dialog" : "M'kay get outta here now! Be safe, don't drink too much, don't do drugs, yadda, yadda, yadda all that good stuff!",
			"newSpeaker" : "false"
		}

    ]
]